gilatoes/amazon-freertos-optiga-trust-x/demos/infineon/xmc4800_iotkit_trustx/common/application_code/infineon_code/optiga_trust_m.c
#include <stdlib.h>
#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"
#include "semphr.h"

#include "optiga/optiga_util.h"
#include "optiga/pal/pal_os_event.h"
#include "optiga/ifx_i2c/ifx_i2c_config.h"
#include "mbedtls/base64.h"
#include "trustm_chipinfo.h"

/* PKCS#11 includes. */
#include "aws_pkcs11.h"

/* Key provisioning includes. */
#include "aws_dev_mode_key_provisioning.h"

/* OPTIGA Trust X defines. */
#define mainTrustX_TASK_STACK_SIZE     		( configMINIMAL_STACK_SIZE * 8 )

char CLIENT_CERTIFICATE_PEM[1124];
uint32_t CLIENT_CERTIFICATE_LENGTH;

// Not used, but required for mbedTLS...
const char CLIENT_PRIVATE_KEY_PEM[] =
//"-----BEGIN EC PARAMETERS-----\n"
//"BggqhkjOPQMBBw==\n"
//"-----END EC PARAMETERS-----\n"
"-----BEGIN EC PRIVATE KEY-----\n"
"MHcCAQEEIH84O6hf145Awun9lH6GbesjSmwJ5w1ODaYhp7xLZRA3oAoGCCqGSM49\n"
"AwEHoUQDQgAEb5ERgUCa0019j5JWdEiH0JyldJF9cv/MW2Lx94n9HVJ9FiQcooFi\n"
"KegulIrIuCLE1a7zsv8Izs/6gY9rxOdHHA==\n"
"-----END EC PRIVATE KEY-----\n";

/*
 * Length of device private key included from aws_clientcredential_keys.h .
 */
const uint32_t CLIENT_PRIVATE_KEY_LENGTH = sizeof( CLIENT_PRIVATE_KEY_PEM );


//optiga_comms_t optiga_comms = {(void*)&ifx_i2c_context_0,NULL,NULL, OPTIGA_COMMS_SUCCESS};
static TimerHandle_t xTrustXInitTimer;
SemaphoreHandle_t xTrustXSemaphoreHandle; /**< OPTIGA™ Trust X module semaphore. */
const TickType_t xTrustXSemaphoreWaitTicks = pdMS_TO_TICKS( 60000 );

extern optiga_lib_status_t trustm_OpenCrypto(void);
extern optiga_lib_status_t trustm_CloseCrypto(void);
extern optiga_lib_status_t  example_authenticate_chip(void);


//uint16_t trustm_open_flag = 0;

#if 0
/**
 * Callback when optiga_util_xxxx operation is completed asynchronously
 */
static volatile optiga_lib_status_t optiga_lib_status;
static void optiga_util_callback(void * context, optiga_lib_status_t return_status)
{
    optiga_lib_status = return_status;
    if (NULL != context)
    {
        // callback to upper layer here
    }
}

#endif

#if 0
static void read_ifx_cert(void)
{
		uint8_t ifx_cert_hex[800];
		uint16_t  ifx_cert_hex_len = sizeof(ifx_cert_hex);
		size_t  ifx_cert_b64_len = 0;
		uint8_t ifx_cert_b64_temp[1124];
		uint16_t offset_to_read = 0;
		uint16_t offset_to_write = 0;
		uint16_t size_to_copy = 0;
		optiga_lib_status_t status;

		uint16_t optiga_oid;

		optiga_util_t * me = NULL;
		optiga_oid = 0xE0E1;

		// IFX_CHECK: eDEVICE_PUBKEY_CERT_IFX or eDEVICE_PUBKEY_CERT_PRJSPC_1

        me = optiga_util_create(0, optiga_util_callback, NULL);
        if (NULL == me)
        {
            return;
        }

		while ( (status = optiga_util_read_data(me, optiga_oid, 0, ifx_cert_hex, &ifx_cert_hex_len)) != OPTIGA_LIB_SUCCESS);

		mbedtls_base64_encode((unsigned char *)ifx_cert_b64_temp, sizeof(ifx_cert_b64_temp),
								&ifx_cert_b64_len,
								ifx_cert_hex + 9, ifx_cert_hex_len - 9);

		memcpy(CLIENT_CERTIFICATE_PEM, "-----BEGIN CERTIFICATE-----\n", 28);
		offset_to_write += 28;

		//Properly copy certificate and format it as pkcs expects
		for (offset_to_read = 0; offset_to_read < ifx_cert_b64_len;)
		{
			// The last block of data usually is less than 64, thus we need to find the leftover
			if ((offset_to_read + 64) >= ifx_cert_b64_len)
				size_to_copy = ifx_cert_b64_len - offset_to_read;
			else
				size_to_copy = 64;
			memcpy(CLIENT_CERTIFICATE_PEM + offset_to_write, ifx_cert_b64_temp + offset_to_read, size_to_copy);
			offset_to_write += size_to_copy;
			offset_to_read += size_to_copy;
			CLIENT_CERTIFICATE_PEM[offset_to_write] = '\n';
			offset_to_write++;
		}

		memcpy(CLIENT_CERTIFICATE_PEM + offset_to_write, "-----END CERTIFICATE-----\n\0", 27);

		CLIENT_CERTIFICATE_LENGTH = offset_to_write + 27;

		printf("%s\n", CLIENT_CERTIFICATE_PEM);
}
#endif

void vTrustXInitCallback( TimerHandle_t xTimer )
{
	xSemaphoreGive(xTrustXSemaphoreHandle);
}

void vTrustXTaskCallbackHandler( void * pvParameters )
{
	optiga_lib_status_t status = OPTIGA_DEVICE_ERROR;

	if ( xSemaphoreTake(xTrustXSemaphoreHandle, xTrustXSemaphoreWaitTicks) == pdTRUE )
	{
	    do
	    {
	    	pal_os_event_init();
	    }while(FALSE);

#if 0
	    utrustm_UID_t UID;
	    optiga_lib_status_t return_status = trustm_Open();
	    if (return_status != OPTIGA_LIB_SUCCESS)
	    {
	    	printf("vTrustXTaskCallbackHandler: error opening Trust M.");
	    }
	    else
	    {
			return_status = trustm_readUID(&UID);

			if (return_status != OPTIGA_LIB_SUCCESS)
			{
				printf("vTrustXTaskCallbackHandler: readUID [0xE0C2] failed\n");
			}
			else
			{
				printf("==================== Trust M Chip Info ===========================\n");
				printf("CIM Identifier             [bCimIdentifer]: 0x%.2x\n", UID.st.bCimIdentifer);
				printf("Platform Identifer   [bPlatformIdentifier]: 0x%.2x\n", UID.st.bPlatformIdentifier);
				printf("Model Identifer         [bModelIdentifier]: 0x%.2x\n", UID.st.bModelIdentifier);
				printf("ID of ROM mask                  [wROMCode]: 0x%.2x%.2x\n",
										UID.st.wROMCode[0],
										UID.st.wROMCode[1]);
				printf("Chip Type                    [rgbChipType]: 0x%.2x 0x%.2x 0x%.2x 0x%.2x 0x%.2x 0x%.2x\n",
										UID.st.rgbChipType[0],
										UID.st.rgbChipType[1],
										UID.st.rgbChipType[2],
										UID.st.rgbChipType[3],
										UID.st.rgbChipType[4],
										UID.st.rgbChipType[5]);
				printf("Batch Number              [rgbBatchNumber]: 0x%.2x 0x%.2x 0x%.2x 0x%.2x 0x%.2x 0x%.2x\n",
										UID.st.rgbBatchNumber[0],
										UID.st.rgbBatchNumber[1],
										UID.st.rgbBatchNumber[2],
										UID.st.rgbBatchNumber[3],
										UID.st.rgbBatchNumber[4],
										UID.st.rgbBatchNumber[5]);
				printf("X-coordinate              [wChipPositionX]: 0x%.2x%.2x\n",
										UID.st.wChipPositionX[0],
										UID.st.wChipPositionX[1]);
				printf("Y-coordinate              [wChipPositionY]: 0x%.2x%.2x\n",
										UID.st.wChipPositionY[0],
										UID.st.wChipPositionY[1]);
				printf("Firmware Identifier [dwFirmwareIdentifier]: 0x%.2x%.2x%.2x%.2x\n",
										UID.st.dwFirmwareIdentifier[0],
										UID.st.dwFirmwareIdentifier[1],
										UID.st.dwFirmwareIdentifier[2],
										UID.st.dwFirmwareIdentifier[3]);
				printf("Build Number                 [rgbESWBuild]: %.2x %.2x\n",
										UID.st.rgbESWBuild[0],
										UID.st.rgbESWBuild[1]);
				}
				printf("\n");

				printf("Chip software build ");
				if ((UID.st.rgbESWBuild[0] == 0x05) && (UID.st.rgbESWBuild[1] == 0x10))
					printf("V1.0.510\n");
				else if ((UID.st.rgbESWBuild[0] == 0x07) && (UID.st.rgbESWBuild[1] == 0x15))
					printf("V1.1.715\n");
				else if ((UID.st.rgbESWBuild[0] == 0x10) && (UID.st.rgbESWBuild[1] == 0x48))
					printf("V1.2.1048\n");
				else if ((UID.st.rgbESWBuild[0] == 0x11) && (UID.st.rgbESWBuild[1] == 0x12))
					printf("V1.30.1112\n");
				else if ((UID.st.rgbESWBuild[0] == 0x11) && (UID.st.rgbESWBuild[1] == 0x18))
					printf("V1.40.1118\n");
				else
					printf("Unknown\n");
				printf("====================================================================\n");

				trustm_Close();
	    }
#endif


	    optiga_lib_status_t return_status = trustm_OpenCrypto();
	    if (return_status != OPTIGA_LIB_SUCCESS)
	    {
	    	printf("vTrustXTaskCallbackHandler: error opening Trust M crypto instance.");
	    }
	    else
	    {
	    	 example_authenticate_chip();

	    	 trustm_CloseCrypto();

	    }

	    //status = example_authenticate_chip();

		//read_ifx_cert();

	    ProvisioningParams_t xParams;

	    xParams.ulClientPrivateKeyType = CKK_EC;
	    xParams.pcClientPrivateKey = ( uint8_t * ) CLIENT_PRIVATE_KEY_PEM;
	    xParams.ulClientPrivateKeyLength = CLIENT_PRIVATE_KEY_LENGTH;
	    xParams.pcClientCertificate = ( uint8_t * ) CLIENT_CERTIFICATE_PEM;
	    xParams.ulClientCertificateLength = CLIENT_CERTIFICATE_LENGTH;

	    vAlternateKeyProvisioning( &xParams );

        DEMO_RUNNER_RunDemos();
	}

	vTaskDelete(NULL);
}

void OPTIGA_TRUST_M_Init(void)
{
	/* Create the handler for the callbacks. */
	xTaskCreate( vTrustXTaskCallbackHandler,       /* Function that implements the task. */
				"TrstXHndlr",          /* Text name for the task. */
				configMINIMAL_STACK_SIZE*8,      /* Stack size in words, not bytes. */
				NULL,    /* Parameter passed into the task. */
				tskIDLE_PRIORITY,/* Priority at which the task is created. */
				NULL );      /* Used to pass out the created task's handle. */

    xTrustXSemaphoreHandle = xSemaphoreCreateBinary();

	xTrustXInitTimer = xTimerCreate("TrustX_init_timer",        /* Just a text name, not used by the kernel. */
									pdMS_TO_TICKS(1),    /* The timer period in ticks. */
									pdFALSE,         /* The timers will auto-reload themselves when they expire. */
									( void * )NULL,   /* Assign each timer a unique id equal to its array index. */
									vTrustXInitCallback  /* Each timer calls the same callback when it expires. */
									);
	if( xTrustXInitTimer == NULL )
	{
		// The timer was not created.
	}
	else
	{
		// Start the timer.  No block time is specified, and even if one was
		// it would be ignored because the scheduler has not yet been
		// started.
		if( xTimerStart( xTrustXInitTimer, 0 ) != pdPASS )
		{
		    // The timer could not be set into the Active state.
		}
	}
}

